In [ ]:
import pandas as pd
import numpy as np

## Задание 0

In [ ]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

Для всех  заданий будем использовать обезличенные транзакционные банковские данные. Для этого считайте в переменные **tr_mcc_codes, tr_types, transactions и gender_train** из одноимённых таблиц из папки [data](https://drive.google.com/drive/folders/1YAMe7MiTxA-RSSd8Ex2p-L0Dspe6Gs4L).

Для таблицы transactions используйте только первые n=1000000 строк. При чтении файлов обратите внимание на разделители внутри каждого из файлов - они могут различаться!

In [ ]:
from google.colab import drive
import pandas as pd
drive.mount('/content/drive/')

tr_mcc_codes = pd.read_csv(filepath_or_buffer = "/content/drive/MyDrive/Data/tr_mcc_codes.csv", sep = ';')
tr_types = pd.read_csv(filepath_or_buffer = "/content/drive/MyDrive/Data/tr_types.csv", sep = ';')
transactions = pd.read_csv(filepath_or_buffer = "/content/drive/MyDrive/Data/transactions.csv", sep = ',', nrows = 1000000)
gender_train = pd.read_csv(filepath_or_buffer = "/content/drive/MyDrive/Data/gender_train.csv", sep = ',')

#tr_mcc_codes
#tr_types
transactions
#gender_train

Drive already mounted at /content/drive/; to attempt to forcibly remount, call drive.mount("/content/drive/", force_remount=True).

        customer_id   tr_datetime  mcc_code  tr_type    amount   term_id
0          39026145    0 10:23:26      4814     1030  -2245.92       NaN
1          39026145    1 10:19:29      6011     7010  56147.89       NaN
2          39026145    1 10:20:56      4829     2330 -56147.89       NaN
3          39026145    1 10:39:54      5499     1010  -1392.47       NaN
4          39026145    2 15:33:42      5499     1010   -920.83       NaN
...             ...           ...       ...      ...       ...       ...
999995     98801178  269 10:29:06      5921     1010 -23016.59    127873
999996     98801178  270 10:26:45      5211     1010 -61380.88  10114209
999997     98801178  270 15:18:53      5921     1010 -11800.27  10105341
999998     98801178  271 12:47:13      5211     1010 -16170.59  10114209
999999     98801178  271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 6 columns]

###  Описание данных
#### Таблица ```transactions.csv```
##### Описание
Таблица содержит историю транзакций клиентов банка за один год и три месяца.

##### Формат данных

```
customer_id,tr_datetime,mcc_code,tr_type,amount,term_id
111111,15 01:40:52,1111,1000,-5224,111111
111112,15 15:18:32,3333,2000,-100,11122233
...
```
##### Описание полей

 - ```customer_id``` — идентификатор клиента;
 - ```tr_datetime``` — день и время совершения транзакции (дни нумеруются с начала данных);
 - ```mcc_code``` — mcc-код транзакции;
 - ```tr_type``` — тип транзакции;
 - ```amount``` — сумма транзакции в условных единицах со знаком; ```+``` — начисление средств клиенту (приходная транзакция), ```-``` — списание средств (расходная транзакция);
 - ```term_id``` — идентификатор терминала;


#### Таблица ```gender_train.csv```

##### Описание
Данная таблица содержит информацию по полу для части клиентов, для которых он известен. Для остальных клиентов пол неизвестен.

##### Формат данных
```
customer_id,gender
111111,0
111112,1
...
```

##### Описание полей
 - ```customer_id``` — идентификатор клиента;
 - ```gender``` — пол клиента;

### Таблица ```tr_mcc_codes.csv```

##### Описание
Данная таблица содержит описание mcc-кодов транзакций.

##### Формат данных
```
mcc_code;mcc_description
1000;словесное описание mcc-кода 1000
2000;словесное описание mcc-кода 2000
...
```

##### Описание полей
 - ```mcc_code``` – mcc-код транзакции;
 - ```mcc_description``` — описание mcc-кода транзакции.

#### Таблица ```tr_types.csv```

##### Описание
Данная таблица содержит описание типов транзакций.

##### Формат данных
```
tr_type;tr_description
1000;словесное описание типа транзакции 1000
2000;словесное описание типа транзакции 2000
...
```

##### Описание полей
 - ```tr_type``` – тип транзакции;
 - ```tr_description``` — описание типа транзакции;

## Задание 1

1. Для столбца tr_type датафрейма transactions выберите произвольные 1000 строк с помощью метода sample
2. В полученной на предыдущем этапе подвыборке найдите долю транзакций (стобец tr_description в датасете tr_types), в которой содержится подстрока 'POS' или 'ATM'

In [ ]:
trtype_random = tr_types.sample(n=1000, replace=True)
#trtype_random is dataframe
condition = trtype_random.tr_description.str.contains('POS|ATM')
ans_1 = len(trtype_random[condition]) / len(trtype_random)
ans_1

0.19

## Задание 2

1. Для столюца tr_type датафрейма transactions посчитайте частоту встречаемости всех типов транзакций tr_type в transactions.
2. Выведите топ-10 транзакций по частоте встречаемости.

In [ ]:
ans = transactions.groupby('tr_type').size().sort_values(ascending=False).head(10)
#ans = pd.DataFrame(ans, columns=["tr_description"])
transactions.tr_type.isin(ans.index)

0          True
1          True
2         False
3          True
4          True
          ...
999995     True
999996     True
999997     True
999998     True
999999     True
Name: tr_type, Length: 1000000, dtype: bool

In [ ]:
tr_types[transactions.tr_type.isin(ans.index)]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

     tr_type                                     tr_description
0       3200  Плата за предоставление услуг посредством моби...
1       3210  Плата за предоставление отчета по счету карты ...
3       4000            Плата за получение наличных в Сбербанке
4       4001  Плата за получение наличных в Сбербанке (в дру...
5       4010        Плата за получение наличных в АТМ Сбербанка
..       ...                                                ...
150     2990                             Списание по требованию
151     2992  Списание средств для погашения задолженности п...
152     3001            Комиссия за обслуживание ссудного счета
153     3030  Плата за обслуживание банковской карты (за пос...
154     3120                Плата за досрочный перевыпуск карты

[150 rows x 2 columns]

In [ ]:
ans.index

Int64Index([1010, 2010, 7070, 1110, 1030, 2370, 7010, 7030, 7071, 1100], dtype='int64', name='tr_type')

## Задание 3
1. В датафрейме transactions найдите клиента с максимальной суммой приходов на карту
2. В датафрейме transactions найдите клиента с максимальной суммой расходов по карте
3. Найдите разницу для этих клиентов между суммой расходов и суммой приходов

In [ ]:
person_sum_str = transactions[transactions['amount'] > 0].groupby('customer_id').sum('amount').nlargest(1, 'amount')
sum_1 = float(person_sum_str['amount'])
print(person_sum_str.index.values)

person_min_str = transactions[transactions['amount'] < 0].groupby('customer_id').sum('amount').nsmallest(1, 'amount')
sum_2 = float(person_min_str['amount'])
print(person_min_str.index.values)

print("Разница", str(sum_1 + sum_2))

[70780820]
[70780820]
Разница -1837317.979973793

## Задание 4
1. Найдите среднее арифметическое и медиану по всем типам транзакций из топ 10 из задания 2
1. Найдите среднее арифметическое и медиану по всем типам транзакций для клиентов из задания 3

In [ ]:
#ans_from_2 = pd.DataFrame(ans_from_2, columns=["frec"])
#ans_from_2 = ans_from_2.reset_index()

In [ ]:
ans_from_2 = transactions.groupby('tr_type').size().sort_values(ascending=False).head(10)
# ans_from_2
ans_from_2 = pd.DataFrame(ans_from_2, columns=["frec"]).reset_index()
# ans_4mean = transactions[transactions['tr_type'].isin(ans_from_2["tr_type"])].groupby('tr_type').amount.mean()
# ans_4med = transactions[transactions['tr_type'].isin(ans_from_2["tr_type"])].groupby('tr_type').amount.median()
# print(ans_4mean, "\n")
# print(ans_4med, "\n")
answer_4_1 = transactions[transactions['tr_type'].isin(ans_from_2['tr_type'])].groupby(['tr_type'])['amount']
print("Среднее арифметическое по всем типам транзакций из топ 10 из задания 2\n ")
print(answer_4_1.mean())
print("\nМедиана по всем типам транзакций из топ 10 из задания 2\n ")
print(answer_4_1.median())
answer_4_2 = transactions[transactions['customer_id'].isin((person_sum_str.index.values, person_min_str.index.values))].groupby(['tr_type'])['amount']
print("Среднее арифметическое по всем типам транзакций для клиентов из задания 3\n ")
print(answer_4_2.mean().to_frame())
print("\nМедиана по всем типам транзакций для клиентов из задания 3\n ")
print(answer_4_2.median().to_frame())

Среднее арифметическое по всем типам транзакций из топ 10 из задания 2

tr_type
1010    -19784.748640
1030     -5320.980222
1100    -44061.827262
1110    -32119.330371
2010   -136077.629325
2370   -205418.249032
7010    276391.789596
7030     86104.332909
7070     65569.831700
7071     66806.826623
Name: amount, dtype: float64

Медиана по всем типам транзакций из топ 10 из задания 2

tr_type
1010     -7411.52
1030     -2245.92
1100    -10188.26
1110    -11207.57
2010    -44918.32
2370    -44918.32
7010    112295.79
7030     13951.52
7070     11319.42
7071      3593.47
Name: amount, dtype: float64
Среднее арифметическое по всем типам транзакций для клиентов из задания 3

               amount
tr_type
2010    -2.941056e+06
2330    -2.382398e+06
2370    -2.218505e+06
6110     1.756293e+04
7020     1.465129e+04
7021     2.850067e+04
7030     1.406196e+04
7031     1.921036e+04
7034     1.430648e+04
7040     2.153833e+04
7070     1.384821e+04
7071     1.860057e+04
7074     2.281159e+04

Медиана по всем типам транзакций для клиентов из задания 3

              amount
tr_type
2010    -3368873.660
2330    -2245915.770
2370    -2245915.770
6110       10028.010
7020       10319.985
7021       28500.670
7030        8848.910
7031       12992.620
7034       14306.480
7040       14396.320
7070        8714.150
7071       12543.440
7074        9387.930

## Подготовка для заданий 5-8

*Из заданий 5-8 нужно выполнить минимум два любых*

Соедините transactions с всеми остальными таблицами (tr_mcc_codes, tr_types, gender_train). Причём с gender_train необходимо смёрджиться с помощью left join, а с оставшимися датафреймами - через inner.
После получения результата таблицы gender_train, tr_types, tr_mcc_codes можно удалить. В результате соединения датафреймов должно получиться 999584 строки.

In [ ]:
transactions = pd.merge(transactions, gender_train, how='left')
transactions = pd.merge(transactions, tr_mcc_codes, how='inner')
transactions = pd.merge(transactions, tr_types, how='inner')
transactions.shape

(999584, 9)

## Задание 5

1. Определите модуль разницы между средними тратами женщин и мужчин (трата - отрицательное значение amount).
2. Определите модуль разницы между средними поступлениями у мужчин и женщин

Обратите внимание, что для вычисления модуля разности точных знаний о том,
какой класc относится к мужчинам, а какой - к женщинам, не требуется.

In [ ]:
transactions

        customer_id  ...                  tr_description
0          39026145  ...  Оплата услуги. Банкоматы СБ РФ
1          39026145  ...  Оплата услуги. Банкоматы СБ РФ
2          39026145  ...  Оплата услуги. Банкоматы СБ РФ
3          39026145  ...  Оплата услуги. Банкоматы СБ РФ
4          39026145  ...  Оплата услуги. Банкоматы СБ РФ
...             ...  ...                             ...
999579     36837532  ...      Возврат  покупки. ТУ СБ РФ
999580      6808459  ...      Возврат  покупки. ТУ СБ РФ
999581     83759123  ...      Возврат  покупки. ТУ СБ РФ
999582     89619970  ...      Возврат  покупки. ТУ СБ РФ
999583     89619970  ...      Возврат  покупки. ТУ СБ РФ

[999584 rows x 9 columns]

In [ ]:
transactions[transactions['amount'] < 0].groupby(['gender']).size()

gender
0.0    219410
1.0    209355
dtype: int64

In [ ]:
group_by_gen_minus = transactions[transactions['amount'] < 0].groupby(['gender'])
gen_1 = group_by_gen_minus.get_group(1)
gen_0 = group_by_gen_minus.get_group(0)
ans_5_1 = abs(gen_1.amount.mean() - gen_0.amount.mean())
print("Модуль разницы между средними тратами женщин и мужчин = ", ans_5_1, "\n")

group_by_gen_plus = transactions[transactions['amount'] > 0].groupby(['gender'])
gen_1_p = group_by_gen_plus.get_group(1)
gen_0_p = group_by_gen_plus.get_group(0)
ans_5_2 = abs(gen_1_p.amount.mean() - gen_0_p.amount.mean())
print("Модуль разницы между средними поступлениями у мужчин и женщин = ", ans_5_2)

Модуль разницы между средними тратами женщин и мужчин =  32718.05492021877

Модуль разницы между средними поступлениями у мужчин и женщин =  63366.57104801515

## Задание 6

1. По всем типам транзакций рассчитайте максимальную сумму прихода на карту (из строго положительных сумм по столбцу amount) отдельно для мужчин и женщин (назовите ее "max_income"). Оставьте по 10 транзакций для мужчин и для женщин, наименьших среди всех транзакций по полученным значениям "max_income".
2. Выделите среди них те, которые встречаются одновременно и у мужчин, и у женщин

In [ ]:
transactions = pd.merge(transactions, gender_train, how='left')
#max_income = transactions[transactions['amount'] > 0].groupby(['gender']).sum('amount')
max_income = transactions[transactions['amount'] > 0].groupby(['gender', 'tr_type'], as_index=False).sum('amount')
#для женщин
ans_6 = max_income[max_income['gender'] == 0.0].sort_values(by='amount').head(10); print(ans_6, "\n")
#для мужчин
ans_6_2 = max_income[max_income['gender'] == 1.0].sort_values(by='amount').head(10); print(ans_6_2)
#подпункт 2
ans_6[ans_6['tr_type'].isin(ans_6_2['tr_type'])]

    gender  tr_type  customer_id  mcc_code    amount
10     0.0     4051     65368200      4829   1122.96
13     0.0     4210     67193294      6011   2245.92
12     0.0     4110     14808847      6011   2245.92
9      0.0     2370     44552122      4829   2335.75
36     0.0     7075     14169381      6010   6737.75
6      0.0     2110     14808847      6011  22459.16
0      0.0     1010    138117896     13032  31532.66
11     0.0     4100    274136448     48088  40334.88
7      0.0     2210     67193294      6011  68315.82
4      0.0     1210     65205704      5499  83644.87

    gender  tr_type  customer_id  mcc_code     amount
44     1.0     2020     46579237      6010    2245.92
47     1.0     4110    110702419     12022    4491.84
38     1.0     1010     42398765     10223   35317.03
71     1.0     8100     47653609      5813   64682.37
48     1.0     6000     61024099      3000   79280.83
66     1.0     7041      6839194      6010   87590.72
46     1.0     2370     56053006      4829  113194.15
57     1.0     7015     66245004      6011  121279.45
45     1.0     2110    110702419     12022  179673.26
43     1.0     2010    303336506     24044  224591.59

    gender  tr_type  customer_id  mcc_code    amount
12     0.0     4110     14808847      6011   2245.92
9      0.0     2370     44552122      4829   2335.75
6      0.0     2110     14808847      6011  22459.16
0      0.0     1010    138117896     13032  31532.66

## Задание 7

1. Найдите суммы затрат по каждой категории для мужчин и для женщин.
2. Найдите топ 5 категорий с самыми большими относительными модулями разности для в тратах для разных полов.

## Задание 8

1. Из поля tr_datetime выделите час tr_hour, в который произошла транзакция, как первые 2 цифры до ":". (\**)
2. Посчитайте ночные поступления для мужчин и женщин. Ночные - это примерно 00-06 часов.